{
    "content": [
        "Dear friends,",
        "A primary aspiration of Getting Unstuck is to support playful learning opportunities where learners can develop both creative and computational fluency by creating, sharing, and reflecting on personally meaningful projects. When we dream big about the questions we have and the ideas we want to explore, we can encounter the experience of &ldquo;hard fun,&rdquo; which Seymour Papert explained as &ldquo;fun because it was hard rather than in spite of being hard.&rdquo; In the creative process, the &ldquo;hard&rdquo; part of hard fun can come from feeling frustrated or stuck, but it can also be incredibly enjoyable and satisfying to figure out how to get unstuck and continue on in our creative journeys. Getting Unstuck was inspired by the idea that we all experience getting stuck and unstuck when we engage in creative work.",
        "From July 6&ndash;17, 2020, participants received a daily email invitation to explore an idea, create a Scratch project, share that project to the daily studio, and reflect on creative process. We designed this learning experience for PK&ndash;12 teachers who are passionate and/or curious about supporting creative work with [Scratch](https://scratch.mit.edu) in the classroom. Even in such a short amount of time (only two weeks!), we all explored new things, reflected deeply on our creative process, and supported and encouraged others in our work. Below, we describe some of the things we saw in Getting Unstuck this year.",
        "More than 1,000 people subscribed to the mailing list and [stat]totals/unique_authors[/stat] made at least one project. Collectively, we made a lot of projects!",
        "[stats][[1000, \"signups\"], [\"$totals/unique_authors\", \"participants\"], [\"$totals/projects\", \"projects\"]][/stats]",
        "Participants came from many places all over the world. With the help of [sb]Translate () to ()::translate[/sb] blocks, we were able to understand each other!",
        "<div id=\"country-map\"></div>",
        "The Getting Unstuck prompts were designed to be accessible to learners of all experience levels, with low floors, wide walls, and high ceilings. We joined Getting Unstuck with a wide range of backgrounds in teaching and learning with Scratch:",
        "$graphic/experience",
        "Developing greater computational and creative fluency can be facilitated through multiple opportunities to create projects&mdash;as Twyla Tharp said, &ldquo;Creativity is a habit.&rdquo; Every day for ten days, we individually created Scratch projects in response to a prompt and shared them to a collective daily studio. Whether you made one project or ten, we made a lot of projects together in a very short period of time:",
        "$graphic/projects",
        "Each prompt asked us to explore a number of different computational concepts and blocks. For example, Day 2 focused on key press interactivity, while Day 6 focused on the *random* block. Regardless of the day, or how complex any individual project was, we used a lot of blocks!",
        "[stats][[\"$totals/block_count\", \"Total number of blocks\"]][/stats]",
        "Prompts also asked us to reflect on our learning&mdash;there is no learning without reflection, as John Dewey noted, especially when it comes to understanding our own creative processes. What we saw in Getting Unstuck was that when all of us reflected in public, those reflections supported our own learning but also supported others&rsquo; learning, especially when we encountered troublesome bugs in our Scratch projects! Not only did we create many projects, we also wrote a lot about our own work, as well as the work of others:",
        "[stats][[\"$totals/hearts_stars\", \"Hearts and Stars\"], [\"$totals/description\", \"Total number of words in notes/credits\"], [\"$totals/comments\", \"Total number of comments\"]][/stats]",
        "While the prompts are designed such that you might spend as little as 30 minutes on any individual project, many of us wrote in our notes/credits on our projects about spending many more hours on our projects&mdash;figuring out what you want to make and then successfully creating the project of your dreams can take time! As we noted earlier, getting stuck and unstuck can also mean experiencing the emotional ups and downs of the creative process. Through our new [visualization tool](https://gettingunstuck.gse.harvard.edu/prompts), we were also able to see our projects in new ways.",
        "Even during this short experience, we saw an explosion of creativity within the daily Scratch studios. Thank you so much for participating in Getting Unstuck 2020! These were some of our thoughts; we&rsquo;d love to hear from you about your experience of Getting Unstuck.",
        "Yours in creative computing,",
        "Paulina + Karen"
    ]
}